library(tidyverse)
library(magrittr)
library(formattable)
library(tibble)
library(dplyr)
library(tidyr)
library(ggplot2)

dataframe_1 <- readxl::read_xls(file.choose(), sheet = 1)
str(dataframe_1)

#### First of all, I need to change format of the variables of the analysis. Make them numeric from textual. 
### And, also, it is reasonable to simplify the structure of the dataset. 
### For that reason, I have decided to split the dataset into several ones.

### Do you use the Internet or not? 
general_internet_usage <- dataframe_1[c(1,87:90),]
apply(general_internet_usage, 2, class) ### every column is character by its class

names(general_internet_usage) <- general_internet_usage[1, ]

general_internet_usage <- general_internet_usage[-c(1,2), ]

general_internet_usage_num <- as.data.frame(apply(general_internet_usage[, -1], 2, as.numeric))
general_internet_usage <- cbind(general_internet_usage[,1], general_internet_usage_num)

str(general_internet_usage) ### Now I converted character into numeric variables

##### just for quick overview of general result on Internet usage among the whole population
whole_usage <- general_internet_usage[,c(1,2,3,4)]
names(whole_usage) <- c("usage", "ocerall", "male", "female")
str(whole_usage)
library(plotrix)
### Все опрошенные
labels <-  
  c(paste('Практически ежедневно: ',64,'%',sep=''),
     paste('Несколько раз в неделю, несколько раз в месяц: ',15,'%',sep=""),
     paste('Эпизодически, либо не пользуюсь: ',21,'%',sep=""))
pie3D(whole_usage$ocerall, labels = labels, explode = 0.1,
      main = "Пользование Интернетом, все опрошенные", col = c("#2166AC", "#D1E5F0", "#F4A582"))

# Мужчины
labels <-  
  c(paste('Практически ежедневно: ',67,'%',sep=''),
    paste('Несколько раз в неделю, несколько раз в месяц: ',15,'%',sep=""),
    paste('Эпизодически, либо не пользуюсь: ',18, '%', sep=""))
pie3D(whole_usage$male, labels = labels, explode = 0.1,
      main = "Пользование Интернетом, мужчины", col = c("deepskyblue3", "coral1", "antiquewhite3"))

# Женщины
labels <-  
  c(paste('Практически ежедневно: ', 61,'%',sep=''),
    paste('Несколько раз в неделю, несколько раз в месяц: ',15,'%',sep=""),
    paste('Эпизодически, либо не пользуюсь: ',24,'%',sep=""))
pie3D(whole_usage$female, labels = labels, explode = 0.1,
      main = "Пользование Интернетом, женщины", col = c("deeppink3", "aquamarine3", "bisque"))


##### I need to group the data about usage of the Internet
whole_usage$usage<- c("Ежедневное и периодическое пользование Интернетом", "Ежедневное и периодическое пользование Интернетом",
                      "Не пользуюсь Интернетом либо делаю это эпизодически")
whole_usage_n <- whole_usage %>% 
  group_by(usage) %>% 
  summarise_all(funs(sum))

fff <- whole_usage_n
names(fff) <- c("Использование", "gen_Все", "gen_Мужчины", "gen_Женщины")
fff <- fff %>% pivot_longer(cols = starts_with("gen"),  
                            values_to = "percent, %",
                            
                            names_prefix = "gen_",
                            
                            values_drop_na = TRUE)
str(fff)
##### visualize
fff$name <- factor(fff$name, levels=c("Все", "Мужчины", "Женщины"))
names(fff) <- c("Использование", "Респонденты", "Доля, %" )
ggplot(fff, aes(fill=`Использование`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Пользуетесь ли Вы интернетом, и если да, то как часто? (закрытый вопрос, один ответ)", subtitle = "Сгруппированы варианты ответов `Практически ежедневно` и `Несколько раз в неделю, несколько раз в месяц`")
  
devtools::install_github('cttobin/ggthemr')
library(ggthemr)
ggthemr('flat dark')
ggthemr_reset()


##### Let's look at the educational difference
soc_net_usage <- dataframe_1[c(1,3:9),]
apply(soc_net_usage, 2, class) ### every column is character by its class

names(soc_net_usage) <- soc_net_usage[1, ]

soc_net_usage <- soc_net_usage[-c(1,2), ]

soc_net_usage_num <- as.data.frame(apply(soc_net_usage[, -1], 2, as.numeric))
soc_net_usage <- cbind(soc_net_usage[,1], soc_net_usage_num)

str(soc_net_usage) ### Now I converted character into numeric variables

##### just for quick overview of general result on Internet usage among the whole population
whole_soc_net_usage <- soc_net_usage[,c(1,2,3,4)]
names(whole_soc_net_usage) <- c("options", "overall", "male", "female")
str(whole_soc_net_usage)
library(plotrix)
### Все опрошенные
labels <-  
  c(paste('Каждый/почти каждый день: ',51,'%',sep=''),
    paste('Несколько раз в неделю: ',17,'%',sep=""),
    paste('Несколько раз в месяц: ',6,'%',sep=""),
    paste('Один раз в месяц и реже: ',4,'%',sep=""),
    paste('Не пользуюсь: ',22,'%',sep=""),
    paste('Не знаю, что это такое / Затрудняюсь ответить: ',0,'%',sep=""))
pie(whole_soc_net_usage$overall, labels = labels, explode = 0.1,
      main = "Использование социальных сетей, все опрошенные", col = c("#2166AC", "#D1E5F0", "#F4A582", "darkorange2", "darkgrey", "gold3"))

# Мужчины
labels <-  
  c(paste('Каждый/почти каждый день: ',44,'%',sep=''),
    paste('Несколько раз в неделю: ',18,'%',sep=""),
    paste('Несколько раз в месяц: ',6,'%',sep=""),
    paste('Один раз в месяц и реже: ',4,'%',sep=""),
    paste('Не пользуюсь: ',28,'%',sep=""),
    paste('Не знаю, что это такое / Затрудняюсь ответить: ',0,'%',sep=""))
pie(whole_soc_net_usage$male, labels = labels, explode = 0.1,
      main = "Использование социальных сетей, мужчины", col = c("#2166AC", "#D1E5F0", "#F4A582", "azure4", "burlywood1", "lemonchiffon4"))


# Женщины
labels <-  
  c(paste('Каждый/почти каждый день: ',58,'%',sep=''),
    paste('Несколько раз в неделю: ',16,'%',sep=""),
    paste('Несколько раз в месяц: ',5,'%',sep=""),
    paste('Один раз в месяц и реже: ',3,'%',sep=""),
    paste('Не пользуюсь: ',17,'%',sep=""),
    paste('Не знаю, что это такое / Затрудняюсь ответить: ',0,'%',sep=""))
pie(whole_soc_net_usage$female, labels = labels, explode = 0.1,
      main = "Использование социальных сетей, женщины", col = c("deeppink3", "aquamarine3", "bisque", "lightblue", "lemonchiffon3", "khaki4"))




##### I need to group the data about usage of social networks.
### It is possible to combine those who definitely somehow use social networks
whole_soc_net_usage$options <- c("Пользование социальными сетями", "Пользование социальными сетями",
              "Пользование социальными сетями", "Пользование социальными сетями", "Не пользуюсь социальными сетями или не знаю, что это такое", "Не пользуюсь социальными сетями или не знаю, что это такое")
whole_soc_net_usage_n <- whole_soc_net_usage %>% 
  group_by(options) %>% 
  summarise_all(funs(sum))

fff1 <- whole_soc_net_usage_n
names(fff1) <- c("Пользование соцсетями", "gen_Все", "gen_Мужчины", "gen_Женщины")
fff1 <- fff1 %>% pivot_longer(cols = starts_with("gen"),  
                            values_to = "percent, %",
                            
                            names_prefix = "gen_",
                            
                            values_drop_na = TRUE)
str(fff1)
##### visualize
fff1$name <- factor(fff1$name, levels=c("Все", "Мужчины", "Женщины"))
names(fff1) <- c("Пользование соцсетями", "Респонденты", "Доля, %" )
ggthemr('flat dark')
ggplot(fff1, aes(fill=`Пользование соцсетями`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Пользуетесь ли Вы какими-либо социальными сетями", subtitle = "Сгруппированы варианты ответов, где респондент заявляет о пользовании соцсетями в той или иной форме и вариантами \n ответов, когда респондент не пользуется соцсетями или не знает, что это такое")
ggthemr_reset()


###### Need to look at gender, education, income, place of living
### But I need to split the dataframe into 8 small ones
privacy_data<- dataframe_1[c(1,34:86), -c(65:79)]

is_it_real <- privacy_data[c(1:7), -c(5:9, 17:27, 35:50,57:64)]

apply(is_it_real, 2, class) ### every column is character by its class

names(is_it_real) <- is_it_real[1, ]

is_it_real <- is_it_real[-c(1,2), ]
names(is_it_real)[1] <- "Как Вы думаете информация, которую Вы размещаете в соцсетях, используется третьими лицами или нет? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом и пользуется какими-либо социальными сетями)"
str(is_it_real)
is_it_real_num <- as.data.frame(apply(is_it_real[, -1], 2, as.numeric))
is_it_real <- cbind(is_it_real[,1], is_it_real_num)

is_it_real$`Как Вы думаете информация, которую Вы размещаете в соцсетях, используется третьими лицами или нет? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом и пользуется какими-либо социальными сетями)` <- c("Используется", "Используется",
                                 "Не используется", "Не используется", "Затрудняюсь ответить")
is_it_real_n <- is_it_real %>% 
  group_by(`Как Вы думаете информация, которую Вы размещаете в соцсетях, используется третьими лицами или нет? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом и пользуется какими-либо социальными сетями)`) %>% 
  summarise_all(funs(sum))

fff2 <- is_it_real_n
names(fff2) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "gen_Все", "gen_Мужчины", "gen_Женщины", "gen_Неполное среднее образование", "gen_Среднее образование", "gen_Среднее спец образование", "gen_Незаконченное высшее, высшее образование", "gen_Практически ежедневно", "gen_Несколько раз в неделю, несколько раз в месяц", "gen_Эпизодически либо не пользуюсь",
                 "gen_Мы едва сводим концы с концами. Денег не хватает даже на продукты", "gen_На продукты денег хватает, но покупка одежды уже затруднительна","gen_Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема", "gen_Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет", "gen_Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",
                 "gen_Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое", "gen_Затрудняюсь ответить", "gen_Москва и Санкт-Петербург", "gen_города - миллионники", "gen_500-950 тыс.", "gen_100-500 тыс.", "gen_до100 тыс.", "gen_село")
fff2 <- fff2 %>% pivot_longer(cols = starts_with("gen"),  
                              values_to = "percent, %",
                              
                              names_prefix = "gen_",
                              
                              values_drop_na = TRUE)
str(fff2)
##### visualize
fff2$name <- factor(fff2$name, levels=c("Все", "Мужчины", "Женщины", "Неполное среднее образование", "Среднее образование",                                                                               
                                       "Среднее спец образование",                                                                         
                                        "Незаконченное высшее, высшее образование",                                                          
                                        "Практически ежедневно",                                                                             
                                        "Несколько раз в неделю, несколько раз в месяц",                                                     
                                        "Эпизодически либо не пользуюсь",                                                                    
                                        "Мы едва сводим концы с концами. Денег не хватает даже на продукты" ,                                
                                        "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                        "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                        "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                        "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет" ,                 
                                        "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое" ,                  
                                        "Затрудняюсь ответить",
                                       "Москва и Санкт-Петербург",                                                                        
                                        "города - миллионники",                                                                             
                                        "500-950 тыс.",                                                                                     
                                        "100-500 тыс.",                                                                                      
                                        "до100 тыс.",                                                                                       
                                        "село"))
names(fff2) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "Респонденты", "Доля, %" )
ggthemr('flat dark')
ggplot(fff2, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Пользуетесь ли Вы какими-либо социальными сетями", subtitle = "Сгруппированы варианты ответов, где респондент заявляет о пользовании соцсетями в той или иной форме и вариантами \n ответов, когда респондент не пользуется соцсетями или не знает, что это такое")
ggthemr_reset()


##### attitude to the problem for gender criteria
fff3 <- fff2[c(1:3, 24:26, 47:49),]
fff4 <- fff2[c(1:3, 24:26, 47:49),]
fff3$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях` <- factor(fff3$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, levels=c("Все", "Мужчины", "Женщины"))
fff3$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`<- fff4$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`
ggthemr('flat dark')
ggplot(fff3, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", subtitle = "Сгруппированы варианты ответов, где респондент заявляет о своей уверенности в использовании информации третьими лицами в той или иной степени, \n и ответы, когда респондент ставит под сомнение подобный вариант развития событий")
ggthemr_reset()


##### education
fff5 <- fff2[c(4:7, 27:30, 50:53),]
fff6 <- fff2[c(4:7, 27:30, 50:53),]
fff5$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях` <- factor(fff5$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, levels=c("Неполное среднее образование", "Среднее образование",                                                                               
                                                                                                                                                                      "Среднее спец образование",                                                                         
                                                                                                                                                                      "Незаконченное высшее, высшее образование"))
fff5$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`<- fff6$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`
names(fff5) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "Образование респондентов", "Доля, %")
ggthemr('dust')
ggplot(fff5, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Образование респондентов`)) + 
  geom_bar(position="dodge", stat="identity") +
  theme(axis.text.x = element_text(size = 7, angle = 45)) +
  ggtitle("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", subtitle = "Образовательный критерий")
ggthemr_reset()


######## Internet usage
fff7 <- fff2[c(8:10, 31:33, 54:56),]
fff8 <- fff2[c(8:10, 31:33, 54:56),]
fff7$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях` <- factor(fff7$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, levels=c("Практически ежедневно",                                                                             
                                                                                                                                                                      "Несколько раз в неделю, несколько раз в месяц",                                                     
                                                                                                                                                                      "Эпизодически либо не пользуюсь"))
fff7$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`<- fff8$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`
names(fff7) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "Пользование Интернетом", "Доля, %")
ggthemr('pale')
ggplot(fff7, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Пользование Интернетом`)) + 
  geom_bar(position="dodge", stat="identity") +
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", subtitle = "Критерий использования Интернета")
ggthemr_reset()


##### economic situation
fff9 <- fff2[c(11:17, 34:40, 57:63),]
fff10 <- fff2[c(11:17, 34:40, 57:63),]
fff9$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях` <- factor(fff9$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, levels=c("Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                                                                                                                                                      "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                                                                                                                                                      "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                                                                                                                                                      "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                                                                                                                                                      "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет" ,                 
                                                                                                                                                                      "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",
                                                                                                                                                                      "Затрудняюсь ответить"))
fff9$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`<- fff10$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`
names(fff9) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "Респонденты по материальному положению", "Доля, %")
ggthemr('lilac')
ggplot(fff9, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Респонденты по материальному положению`)) + 
  geom_bar(position="dodge", stat="identity") +
  theme(axis.text.x = element_text(size = 7, angle = 40)) +
  ggtitle("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", subtitle = "Материальное положение")
ggthemr_reset()

##### Life location
fff11 <- fff2[c(18:23, 41:46, 64:69),]
fff12 <- fff2[c(18:23, 41:46, 64:69),]
fff11$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях` <- factor(fff11$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, levels=c("Москва и Санкт-Петербург",                                                                        
                                                                                                                                                                        "города - миллионники",                                                                             
                                                                                                                                                                        "500-950 тыс.",                                                                                     
                                                                                                                                                                        "100-500 тыс.",                                                                                      
                                                                                                                                                                        "до100 тыс.",                                                                                       
                                                                                                                                                                        "село"))
fff11$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`<- fff12$`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`
names(fff11) <- c("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", "Тип населенного пункта", "Доля, %")
ggthemr('fresh')
ggplot(fff11, aes(fill=`Используют ли третьи лица вашу информацию, размещаемую в соцсетях`, y=`Доля, %`, x=`Тип населенного пункта`)) + 
  geom_bar(position="dodge", stat="identity") +
  theme(axis.text.x = element_text(size = 7, angle = 40)) +
  ggtitle("Используют ли третьи лица вашу информацию, размещаемую в соцсетях", subtitle = "Место проживания респондентов")
ggthemr_reset()



######### 
attitude_pd <- privacy_data[c(1,8:12), -c(5:9, 17:27, 35:50,57:64)]

apply(attitude_pd, 2, class) ### every column is character by its class

names(attitude_pd) <- attitude_pd[1, ]

attitude_pd <- attitude_pd[-c(1,2), ]
names(attitude_pd)[1] <- "Как Вы в целом относитесь к тому, что Ваша личная информация в соцсетях используется третьими лицами? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом, пользуется какими-либо социальными сетями и считает, что информация, размещаемая ими в соцсетях используется третьими лицами)"
str(attitude_pd)
attitude_pd_num <- as.data.frame(apply(attitude_pd[, -1], 2, as.numeric))
attitude_pd <- cbind(attitude_pd[,1], attitude_pd_num)


fff21 <- attitude_pd
names(fff21) <- c("Отношение к использованию личной информации третьими лицами", "gen_Все", "gen_Мужчины", "gen_Женщины", "gen_Неполное среднее образование", "gen_Среднее образование", "gen_Среднее спец образование", "gen_Незаконченное высшее, высшее образование", "gen_Практически ежедневно", "gen_Несколько раз в неделю, несколько раз в месяц", "gen_Эпизодически либо не пользуюсь",
                 "gen_Мы едва сводим концы с концами. Денег не хватает даже на продукты", "gen_На продукты денег хватает, но покупка одежды уже затруднительна","gen_Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема", "gen_Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет", "gen_Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",
                 "gen_Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое", "gen_Затрудняюсь ответить", "gen_Москва и Санкт-Петербург", "gen_города - миллионники", "gen_500-950 тыс.", "gen_100-500 тыс.", "gen_до100 тыс.", "gen_село")
fff21 <- fff21 %>% pivot_longer(cols = starts_with("gen"),  
                              values_to = "percent, %",
                              
                              names_prefix = "gen_",
                              
                              values_drop_na = TRUE)
str(fff21)
##### visualize
fff21$name <- factor(fff21$name, levels=c("Все", "Мужчины", "Женщины", "Неполное среднее образование", "Среднее образование",                                                                               
                                        "Среднее спец образование",                                                                         
                                        "Незаконченное высшее, высшее образование",                                                          
                                        "Практически ежедневно",                                                                             
                                        "Несколько раз в неделю, несколько раз в месяц",                                                     
                                        "Эпизодически либо не пользуюсь",                                                                    
                                        "Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                        "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                        "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                        "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                        "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",                 
                                        "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",                  
                                        "Затрудняюсь ответить",
                                        "Москва и Санкт-Петербург",                                                                        
                                        "города - миллионники",                                                                             
                                        "500-950 тыс.",                                                                                     
                                        "100-500 тыс.",                                                                                      
                                        "до100 тыс.",                                                                                       
                                        "село"))
names(fff21) <- c("Отношение к использованию личной информации третьими лицами", "Респонденты", "Доля, %" )
library(ggthemr)
ggthemr('chalk')
ggplot(fff21, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Отношение к использованию личной информации третьими лицами")
ggthemr_reset()

##### attitude to the problem for gender criteria
fff31 <- fff21[c(1:3, 24:26, 47:49,70:72),]
fff41 <- fff21[c(1:3, 24:26, 47:49, 70:72),]
fff31$`Отношение к использованию личной информации третьими лицами` <- factor(fff31$`Отношение к использованию личной информации третьими лицами`, levels=c("Все", "Мужчины", "Женщины"))
fff31$`Отношение к использованию личной информации третьими лицами`<- fff41$`Отношение к использованию личной информации третьими лицами`
ggthemr('copper')
ggplot(fff31, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Отношение к использованию личной информации третьими лицами")
ggthemr_reset()

###### education
fff51 <- fff21[c(4:7, 27:30, 50:53,73:76),]
fff61 <- fff21[c(4:7, 27:30, 50:53, 73:76),]
fff51$`Отношение к использованию личной информации третьими лицами` <- factor(fff51$`Отношение к использованию личной информации третьими лицами`, levels=c("Неполное среднее образование", "Среднее образование",                                                                               
                                                                                                                                                            "Среднее спец образование",                                                                         
                                                                                                                                                            "Незаконченное высшее, высшее образование"))
fff51$`Отношение к использованию личной информации третьими лицами`<- fff61$`Отношение к использованию личной информации третьими лицами`
ggthemr('solarized')
names(fff51) <- c("Отношение к использованию личной информации третьими лицами", "Образование респондентов", "Доля, %")
ggplot(fff51, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Образование респондентов`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию личной информации третьими лицами", subtitle = "Образовательный критерий")
ggthemr_reset()


####### Internet usage
fff71 <- fff21[c(8:10, 31:33, 54:56,77:79),]
fff81 <- fff21[c(8:10, 31:33, 54:56, 77:79),]
fff71$`Отношение к использованию личной информации третьими лицами` <- factor(fff71$`Отношение к использованию личной информации третьими лицами`, levels=c("Практически ежедневно",                                                                             
                                                                                                                                                             "Несколько раз в неделю, несколько раз в месяц",                                                     
                                                                                                                                                             "Эпизодически либо не пользуюсь"))
fff71$`Отношение к использованию личной информации третьими лицами`<- fff81$`Отношение к использованию личной информации третьими лицами`
ggthemr('flat')
names(fff71) <- c("Отношение к использованию личной информации третьими лицами", "Пользование Интернетом", "Доля, %")
ggplot(fff71, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Пользование Интернетом`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию личной информации третьими лицами", subtitle = "Как часто респондент пользуется Интернетом")
ggthemr_reset()


####### Economic situation
fff91 <- fff21[c(11:17, 34:40, 57:63,80:86),]
fff101 <- fff21[c(11:17, 34:40, 57:63, 80:86),]
fff91$`Отношение к использованию личной информации третьими лицами` <- factor(fff91$`Отношение к использованию личной информации третьими лицами`, levels=c("Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                                                                                                                                            "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                                                                                                                                            "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                                                                                                                                            "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                                                                                                                                            "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет" ,                 
                                                                                                                                                            "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",
                                                                                                                                                            "Затрудняюсь ответить"))
fff91$`Отношение к использованию личной информации третьими лицами`<- fff101$`Отношение к использованию личной информации третьими лицами`
ggthemr('grape')
names(fff91) <- c("Отношение к использованию личной информации третьими лицами", "Материальное положение", "Доля, %")
ggplot(fff91, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Материальное положение`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 7, angle = 45)) +
  ggtitle("Отношение к использованию личной информации третьими лицами", subtitle = "Как респонденты оценивают экономическое положение своей семьи")
ggthemr_reset()




####### Life location
fff91 <- fff21[c(18:23, 41:46, 64:69,87:92),]
fff101 <- fff21[c(18:23, 41:46, 64:69, 87:92),]
fff91$`Отношение к использованию личной информации третьими лицами` <- factor(fff91$`Отношение к использованию личной информации третьими лицами`, levels=c("Москва и Санкт-Петербург",                                                                        
                                                                                                                                                            "города - миллионники",                                                                             
                                                                                                                                                            "500-950 тыс.",                                                                                     
                                                                                                                                                            "100-500 тыс.",                                                                                      
                                                                                                                                                            "до100 тыс.",                                                                                       
                                                                                                                                                            "село"))
fff91$`Отношение к использованию личной информации третьими лицами`<- fff101$`Отношение к использованию личной информации третьими лицами`
ggthemr('earth')
names(fff91) <- c("Отношение к использованию личной информации третьими лицами", "Тип населенного пункта", "Доля, %")
ggplot(fff91, aes(fill=`Отношение к использованию личной информации третьими лицами`, y=`Доля, %`, x=`Тип населенного пункта`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию личной информации третьими лицами", subtitle = "Место проживания респондентов")
ggthemr_reset()



##############
##############
##############
attitude_among_non_believers <- privacy_data[c(1,13:17), -c(5:9, 17:27, 35:50,57:64)]

apply(attitude_among_non_believers, 2, class) ### every column is character by its class

names(attitude_among_non_believers) <- attitude_among_non_believers[1, ]

attitude_among_non_believers <- attitude_among_non_believers[-c(1,2), ]
names(attitude_among_non_believers)[1] <- "Как Вы в целом относитесь к тому, что Ваша личная информация в соцсетях может быть использована третьими лицами? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом, пользуется какими-либо социальными сетями и считает, что информация, размещаемая ими в соцсетях не используется третьими лицами)"
str(attitude_among_non_believers)
attitude_among_non_believers_num <- as.data.frame(apply(attitude_among_non_believers[, -1], 2, as.numeric))
attitude_among_non_believers <- cbind(attitude_among_non_believers[,1], attitude_among_non_believers_num)


fff111 <- attitude_among_non_believers
names(fff111) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "gen_Все", "gen_Мужчины", "gen_Женщины", "gen_Неполное среднее образование", "gen_Среднее образование", "gen_Среднее спец образование", "gen_Незаконченное высшее, высшее образование", "gen_Практически ежедневно", "gen_Несколько раз в неделю, несколько раз в месяц", "gen_Эпизодически либо не пользуюсь",
                  "gen_Мы едва сводим концы с концами. Денег не хватает даже на продукты", "gen_На продукты денег хватает, но покупка одежды уже затруднительна","gen_Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема", "gen_Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет", "gen_Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",
                  "gen_Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое", "gen_Затрудняюсь ответить", "gen_Москва и Санкт-Петербург", "gen_города - миллионники", "gen_500-950 тыс.", "gen_100-500 тыс.", "gen_до100 тыс.", "gen_село")
fff111 <- fff111 %>% pivot_longer(cols = starts_with("gen"),  
                                values_to = "percent, %",
                                
                                names_prefix = "gen_",
                                
                                values_drop_na = TRUE)
str(fff111)
##### visualize
fff111$name <- factor(fff111$name, levels=c("Все", "Мужчины", "Женщины", "Неполное среднее образование", "Среднее образование",                                                                               
                                          "Среднее спец образование",                                                                         
                                          "Незаконченное высшее, высшее образование",                                                          
                                          "Практически ежедневно",                                                                             
                                          "Несколько раз в неделю, несколько раз в месяц",                                                     
                                          "Эпизодически либо не пользуюсь",                                                                    
                                          "Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                          "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                          "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                          "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                          "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",                 
                                          "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",                  
                                          "Затрудняюсь ответить",
                                          "Москва и Санкт-Петербург",                                                                        
                                          "города - миллионники",                                                                             
                                          "500-950 тыс.",                                                                                     
                                          "100-500 тыс.",                                                                                      
                                          "до100 тыс.",                                                                                       
                                          "село"))
names(fff111) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "Респонденты", "Доля, %" )
library(ggthemr)
ggthemr('chalk')
ggplot(fff111, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент")
ggthemr_reset()

##### attitude to the problem for gender criteria
fff3111 <- fff111[c(1:3, 24:26, 47:49,70:72),]
fff4111 <- fff111[c(1:3, 24:26, 47:49, 70:72),]
fff3111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент` <- factor(fff3111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, levels=c("Все", "Мужчины", "Женщины"))
fff3111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`<- fff4111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`
ggthemr('copper')
ggplot(fff3111, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент") +
  labs(fill = "Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент")
ggthemr_reset()





###### education
fff5111 <- fff111[c(4:7, 27:30, 50:53,73:76),]
fff6111 <- fff111[c(4:7, 27:30, 50:53, 73:76),]
fff5111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент` <- factor(fff5111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, levels=c("Неполное среднее образование", "Среднее образование",                                                                               
                                                                                                                                                            "Среднее спец образование",                                                                         
                                                                                                                                                            "Незаконченное высшее, высшее образование"))
fff5111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`<- fff6111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`
ggthemr('solarized')
names(fff5111) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "Образование респондентов", "Доля, %")
ggplot(fff5111, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Образование респондентов`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Общее отношение к использованию личной информации третьими лицами среди \n тех, кто считает такое использование невозможным в настоящий момент", subtitle = "Образовательный критерий")+
  labs(fill = "Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент")
ggthemr_reset()


####### Internet usage
fff7111 <- fff111[c(8:10, 31:33, 54:56,77:79),]
fff8111 <- fff111[c(8:10, 31:33, 54:56, 77:79),]
fff7111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент` <- factor(fff7111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, levels=c("Практически ежедневно",                                                                             
                                                                                                                                                            "Несколько раз в неделю, несколько раз в месяц",                                                     
                                                                                                                                                            "Эпизодически либо не пользуюсь"))
fff7111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`<- fff8111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`
ggthemr('flat')
names(fff7111) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "Пользование Интернетом", "Доля, %")
ggplot(fff7111, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Пользование Интернетом`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент", subtitle = "Как часто респондент пользуется Интернетом") +
  labs(fill = "Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент")
ggthemr_reset()


####### Economic situation
fff9111 <- fff111[c(11:17, 34:40, 57:63,80:86),]
fff10111 <- fff111[c(11:17, 34:40, 57:63, 80:86),]
fff9111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент` <- factor(fff9111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, levels=c("Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                                                                                                                                            "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                                                                                                                                            "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                                                                                                                                            "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                                                                                                                                            "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет" ,                 
                                                                                                                                                            "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",
                                                                                                                                                            "Затрудняюсь ответить"))
fff9111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`<- fff10111$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`
ggthemr('grape')
names(fff9111) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "Материальное положение", "Доля, %")
ggplot(fff9111, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Материальное положение`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 7, angle = 45)) +
  ggtitle("Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент", subtitle = "Как респонденты оценивают экономическое положение своей семьи")+
  labs(fill = "Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент")
ggthemr_reset()




####### Life location
fff91112 <- fff111[c(18:23, 41:46, 64:69,87:92),]
fff10112 <- fff111[c(18:23, 41:46, 64:69, 87:92),]
fff91112$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент` <- factor(fff91112$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, levels=c("Москва и Санкт-Петербург",                                                                        
                                                                                                                                                            "города - миллионники",                                                                             
                                                                                                                                                            "500-950 тыс.",                                                                                     
                                                                                                                                                            "100-500 тыс.",                                                                                      
                                                                                                                                                            "до100 тыс.",                                                                                       
                                                                                                                                                            "село"))
fff91112$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`<- fff10112$`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`
ggthemr('earth')
names(fff91112) <- c("Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент", "Тип населенного пункта", "Доля, %")
ggplot(fff91112, aes(fill=`Общее отношение к использованию личной информации третьими лицами среди тех, кто считает такое использование невозможным в настоящий момент`, y=`Доля, %`, x=`Тип населенного пункта`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент", subtitle = "Место проживания респондентов") +
  labs(fill = "Общее отношение к использованию личной информации третьими лицами \n среди тех, кто считает такое использование невозможным в настоящий момент")

ggthemr_reset()
############## Social networks use your data
social_networks_data_usage <- privacy_data[c(1,46:50), -c(5:9, 17:27, 35:50,57:64)]

apply(social_networks_data_usage, 2, class) ### every column is character by its class

names(social_networks_data_usage) <- social_networks_data_usage[1, ]

social_networks_data_usage <- social_networks_data_usage[-c(1,2), ]
names(social_networks_data_usage)[1] <- "Операторы социальных сетей могут использовать в своих целях Ваши личные данные, для которых Вы дали согласие на обработку и использование (в том числе передавать их другим компаниям). Как Вы к этому относитесь? (закрытый вопрос, один ответ, от тех, кто пользуется Интернетом и пользуется какими-либо социальными сетями)"
str(social_networks_data_usage)
social_networks_data_usage_num <- as.data.frame(apply(social_networks_data_usage[, -1], 2, as.numeric))
social_networks_data_usage <- cbind(social_networks_data_usage[,1], social_networks_data_usage_num)


fff_soc <- social_networks_data_usage
names(fff_soc) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "gen_Все", "gen_Мужчины", "gen_Женщины", "gen_Неполное среднее образование", "gen_Среднее образование", "gen_Среднее спец образование", "gen_Незаконченное высшее, высшее образование", "gen_Практически ежедневно", "gen_Несколько раз в неделю, несколько раз в месяц", "gen_Эпизодически либо не пользуюсь",
                   "gen_Мы едва сводим концы с концами. Денег не хватает даже на продукты", "gen_На продукты денег хватает, но покупка одежды уже затруднительна","gen_Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема", "gen_Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет", "gen_Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",
                   "gen_Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое", "gen_Затрудняюсь ответить", "gen_Москва и Санкт-Петербург", "gen_города - миллионники", "gen_500-950 тыс.", "gen_100-500 тыс.", "gen_до100 тыс.", "gen_село")
fff_soc <- fff_soc %>% pivot_longer(cols = starts_with("gen"),  
                                  values_to = "percent, %",
                                  
                                  names_prefix = "gen_",
                                  
                                  values_drop_na = TRUE)
str(fff_soc)
##### visualize
fff_soc$name <- factor(fff_soc$name, levels=c("Все", "Мужчины", "Женщины", "Неполное среднее образование", "Среднее образование",                                                                               
                                            "Среднее спец образование",                                                                         
                                            "Незаконченное высшее, высшее образование",                                                          
                                            "Практически ежедневно",                                                                             
                                            "Несколько раз в неделю, несколько раз в месяц",                                                     
                                            "Эпизодически либо не пользуюсь",                                                                    
                                            "Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                            "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                            "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                            "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                            "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет",                 
                                            "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",                  
                                            "Затрудняюсь ответить",
                                            "Москва и Санкт-Петербург",                                                                        
                                            "города - миллионники",                                                                             
                                            "500-950 тыс.",                                                                                     
                                            "100-500 тыс.",                                                                                      
                                            "до100 тыс.",                                                                                       
                                            "село"))
names(fff_soc) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "Респонденты", "Доля, %" )
library(ggthemr)
ggthemr('chalk')
ggplot(fff_soc, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Респонденты`)) + 
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях")
ggthemr_reset()

##### attitude to the problem for gender criteria
fff_soc_1 <- fff_soc[c(1:3, 24:26, 47:49,70:72),]
fff_soc_2 <- fff_soc[c(1:3, 24:26, 47:49, 70:72),]
fff_soc_1$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- factor(fff_soc_1$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, levels=c("Все", "Мужчины", "Женщины"))
fff_soc_1$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`<- fff_soc_2$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`
ggthemr('flat dark')
ggplot(fff_soc_1, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Респонденты`)) + 
  scale_fill_manual(values=c("blue", "red", "yellow", "green"))+
  geom_bar(position="dodge", stat="identity") +
  ggtitle("Отношение к использованию персональных данных \n операторами социальных сетей в коммерческих целях") +
  labs(fill = "Отношение к использованию персональных \n данных операторами социальных сетей в коммерческих целях")
ggthemr_reset()





###### education
fff_soc_3 <- fff_soc[c(4:7, 27:30, 50:53,73:76),]
fff_soc_4 <- fff_soc[c(4:7, 27:30, 50:53, 73:76),]
fff_soc_3$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- factor(fff_soc_3$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, levels=c("Неполное среднее образование", "Среднее образование",                                                                               
                                                                                                                                                                                                                                                                                                                                "Среднее спец образование",                                                                         
                                                                                                                                                                                                                                                                                                                                "Незаконченное высшее, высшее образование"))
fff_soc_3$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- fff_soc_4$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`
ggthemr('solarized')
names(fff_soc_3) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "Образование респондентов", "Доля, %")
ggplot(fff_soc_3, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Образование респондентов`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию персональных данных операторами \n социальных сетей в коммерческих целях", subtitle = "Образовательный критерий")+
  labs(fill = "Отношение к использованию персональных данных \n операторами социальных сетей в коммерческих целях")
ggthemr_reset()


####### Internet usage
fff_soc_5 <- fff_soc[c(8:10, 31:33, 54:56,77:79),]
fff_soc_6 <- fff_soc[c(8:10, 31:33, 54:56, 77:79),]
fff_soc_5$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- factor(fff_soc_5$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, levels=c("Практически ежедневно", "Несколько раз в неделю, несколько раз в месяц",                                                     
                                                                                                                                                                                                                                            "Эпизодически либо не пользуюсь"))
fff_soc_5$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- fff_soc_6$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`
ggthemr('flat')
names(fff_soc_5) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "Пользование Интернетом", "Доля, %")
ggplot(fff_soc_5, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Пользование Интернетом`)) + 
  geom_bar(position="dodge", stat="identity") + 
  scale_fill_manual(values=c("blue", "red", "yellow", "green"))+
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию персональных \n данных операторами социальных сетей в коммерческих целях", subtitle = "Как часто респондент пользуется Интернетом") +
  labs(fill = "Отношение к использованию персональных данных \n операторами социальных сетей в коммерческих целях")
ggthemr_reset()


####### Economic situation
fff_soc_7 <- fff_soc[c(11:17, 34:40, 57:63,80:86),]
fff_soc_8 <- fff_soc[c(11:17, 34:40, 57:63, 80:86),]
fff_soc_7$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- factor(fff_soc_7$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, levels=c("Мы едва сводим концы с концами. Денег не хватает даже на продукты",                                
                                                                                                                                                                                                                                                                                                                                "На продукты денег хватает, но покупка одежды уже затруднительна",                                   
                                                                                                                                                                                                                                                                                                                                "Денег хватает на продукты и одежду, но покупка холодильника, телевизора, мебели – для нас проблема",
                                                                                                                                                                                                                                                                                                                                "Мы можем без труда купить холодильник, телевизор, мебель, но на большее денег нет",                 
                                                                                                                                                                                                                                                                                                                                "Мы можем без труда купить автомобиль, но на большее – квартиру, дачу - денег нет" ,                 
                                                                                                                                                                                                                                                                                                                                "Мы можем позволить себе практически все: машину, квартиру, дачу и многое другое",
                                                                                                                                                                                                                                                                                                                                "Затрудняюсь ответить"))
fff_soc_7$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`<- fff_soc_8$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`
ggthemr('grape')
names(fff_soc_7) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "Материальное положение", "Доля, %")
ggplot(fff_soc_7, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Материальное положение`)) + 
  geom_bar(position="dodge", stat="identity") + 
  theme(axis.text.x = element_text(size = 7, angle = 45)) +
  ggtitle("Отношение к использованию персональных данных \n операторами социальных сетей в коммерческих целях", subtitle = "Как респонденты оценивают экономическое положение своей семьи")+
  labs(fill = "Отношение к использованию персональных \n данных операторами социальных сетей в коммерческих целях")
ggthemr_reset()




####### Life location
fff_soc_9 <- fff_soc[c(18:23, 41:46, 64:69,87:92),]
fff_soc_10 <- fff_soc[c(18:23, 41:46, 64:69, 87:92),]
fff_soc_9$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях` <- factor(fff_soc_9$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, levels=c("Москва и Санкт-Петербург",                                                                        
                                                                                                                                                                                                                                                                                                                                  "города - миллионники",                                                                             
                                                                                                                                                                                                                                                                                                                                  "500-950 тыс.",                                                                                     
                                                                                                                                                                                                                                                                                                                                  "100-500 тыс.",                                                                                      
                                                                                                                                                                                                                                                                                                                                  "до100 тыс.",                                                                                       
                                                                                                                                                                                                                                                                                                                                  "село"))
fff_soc_9$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`<- fff_soc_10$`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`
ggthemr('earth')
names(fff_soc_9) <- c("Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях", "Тип населенного пункта", "Доля, %")
ggplot(fff_soc_9, aes(fill=`Отношение к использованию персональных данных операторами социальных сетей в коммерческих целях`, y=`Доля, %`, x=`Тип населенного пункта`)) + 
  geom_bar(position="dodge", stat="identity") + 
  scale_fill_manual(values=c("blue", "red", "yellow", "green"))+
  theme(axis.text.x = element_text(size = 9, angle = 45)) +
  ggtitle("Отношение к использованию персональных данных операторами \n социальных сетей в коммерческих целях", subtitle = "Место проживания респондентов") +
  labs(fill = "Отношение к использованию персональных \n данных операторами социальных сетей в коммерческих целях")

ggthemr_reset()



##########
